#!/usr/bin/pyhton
# -*- coding:utf-8 -*-

import requests

'''
python爬虫入门的第一个库：requests
requests库本质上就是模拟了我们用浏览器打开一个网页，发起请求是的动作。它能够迅速的把请求的html源文件保存到本地以下
-------------------------------------------------------------------
requests.request()  |  构造一个请求，支撑各方法的基础方法
-------------------------------------------------------------------
requests.get()      |  获取HTML网页的主要方法，对应于HTTP的GET
-------------------------------------------------------------------
requests.head()     |  获取HTML网页头信息的方法，对应于HTTP的HEAD
-------------------------------------------------------------------
requests.post()     |  向HTML网页提交POST请求的方法，对应于HTTP的POST
-------------------------------------------------------------------
requests.put()      |  向HTML网页提交PUT请求的方法，对应于HTPP的PUT
-------------------------------------------------------------------
requests.patch()    |  向HTML网页提交局部修改请求，对应于HTTP的PATCH
-------------------------------------------------------------------
requests.delete()   |  向HTML页面提交删除请求，对应于HTTP的DELETE
-------------------------------------------------------------------
'''


if __name__ == '__main__':
    r = requests.get('https://www.baidu.com/')   # get 方法返回的是一个Response对象
    print r.text